## "Потерянная карточка"

### Задание

Для настольной игры используются карточки с номерами от 1 до n. Одна карточка потерялась. \
Найдите ее, зная номера оставшихся карточек. 

Вводится число n - количество карточек, затем n−1 чисел: номера оставшихся карточек (различные числа от 1 до n). \
Программа должна вывести номер потерянной карточки.

### Формат входных данных

Дано целое число n - количество карточек \
И еще n-1 целых чисел: номера оставшихся карточек.

### Формат выходных данных

Выведите номер потерянной карточки.

### Решение задачи

n = int(input("Количество карточек: "))
full_sum_card = 0
i = 1

# Цикл, который выполнится n-1 раз

while i <= n :
    full_sum_card += i
    i += 1
sum_card = 0
i = 1
while i <= n  - 1:
    card_num = int(input("Номер карточки :"))
    sum_card += card_num
    i += 1
print("Номер потерянной карточки:", full_sum_card - sum_card)
```
