# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

i = 0
while i <= len(names) -1 :
    if i == len(names) -1 :
        print(names[i])
    else :
        print(names[i], end = ", ")
    i += 1


# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
